# Question 1

In [39]:
'''
1) How-to-count-distance-to-the-previous-zero
For each value, count the difference back to the previous zero (or the start of the Series,
whichever is closer)
create a new column 'Y' =[1,2,0,1,2,3,4,0,1,2]
'''
import pandas as pd
df = pd.DataFrame({'X': [7, 2, 0, 3, 4, 2, 5, 0, 3, 4]})

In [40]:
x = (df['X'] != 0).cumsum()

In [41]:
x

0    1
1    2
2    2
3    3
4    4
5    5
6    6
7    6
8    7
9    8
Name: X, dtype: int32

In [42]:
x.shift()

0    NaN
1    1.0
2    2.0
3    2.0
4    3.0
5    4.0
6    5.0
7    6.0
8    6.0
9    7.0
Name: X, dtype: float64

In [43]:
y = x != x.shift()
y

0     True
1     True
2    False
3     True
4     True
5     True
6     True
7    False
8     True
9     True
Name: X, dtype: bool

In [44]:
y.shift()

0      NaN
1     True
2     True
3    False
4     True
5     True
6     True
7     True
8    False
9     True
Name: X, dtype: object

In [45]:
y != y.shift()

0     True
1    False
2     True
3     True
4    False
5    False
6    False
7     True
8     True
9    False
Name: X, dtype: bool

In [46]:
y != y.shift().cumsum()

0     True
1    False
2     True
3     True
4     True
5     True
6     True
7     True
8     True
9     True
Name: X, dtype: bool

In [47]:
y[y != y.shift().cumsum()]

0     True
2    False
3     True
4     True
5     True
6     True
7    False
8     True
9     True
Name: X, dtype: bool

In [48]:
 Y = y.groupby((y != y.shift()).cumsum()).cumsum()

In [49]:
type(Y)

pandas.core.series.Series

In [50]:
df['Y'] = Y.astype(int)

# Output - Column Y contains - for each value, count the difference back to the previous zero

In [51]:
df

   X  Y
0  7  1
1  2  2
2  0  0
3  3  1
4  4  2
5  2  3
6  5  4
7  0  0
8  3  1
9  4  2

# Question 2

In [52]:
'''
2) Create a DatetimeIndex that contains each business day of 2015 and use it to index a
Series of random numbers.
'''
#Return a fixed frequency datetime index, with business day as the default
import numpy as np
from datetime import datetime
start = datetime(2011, 1, 1)
end = datetime(2012, 1, 1)
rng = pd.bdate_range(start,end, freq='B')

In [53]:
rng

DatetimeIndex(['2011-01-03', '2011-01-04', '2011-01-05', '2011-01-06',
               '2011-01-07', '2011-01-10', '2011-01-11', '2011-01-12',
               '2011-01-13', '2011-01-14',
               ...
               '2011-12-19', '2011-12-20', '2011-12-21', '2011-12-22',
               '2011-12-23', '2011-12-26', '2011-12-27', '2011-12-28',
               '2011-12-29', '2011-12-30'],
              dtype='datetime64[ns]', length=260, freq='B')

In [54]:
ts = pd.Series(np.random.randn(len(rng)), index=rng)

In [55]:
ts.head()

2011-01-03    0.753737
2011-01-04   -1.131412
2011-01-05   -0.098488
2011-01-06    0.589136
2011-01-07   -0.465583
Freq: B, dtype: float64

In [56]:
ts.shape

(260,)

# Output - DatetimeIndex that contains each business day of 2015 and use it to index a Series of random numbers

In [57]:
type(ts)

pandas.core.series.Series

In [58]:
ts.index[:5]

DatetimeIndex(['2011-01-03', '2011-01-04', '2011-01-05', '2011-01-06',
               '2011-01-07'],
              dtype='datetime64[ns]', freq='B')

# Question 3

In [59]:
'''
3) Find the sum of the values in s for every Wednesday
'''

'\n3) Find the sum of the values in s for every Wednesday\n'

In [60]:
s = pd.DataFrame(ts,columns=['Value'])

In [61]:
s.head()

               Value
2011-01-03  0.753737
2011-01-04 -1.131412
2011-01-05 -0.098488
2011-01-06  0.589136
2011-01-07 -0.465583

In [62]:
s = s.reset_index()

In [63]:
s = s.rename(columns={'index':'Date'})

In [64]:
s.head()

        Date     Value
0 2011-01-03  0.753737
1 2011-01-04 -1.131412
2 2011-01-05 -0.098488
3 2011-01-06  0.589136
4 2011-01-07 -0.465583

In [65]:
s['Week_Day'] = pd.to_datetime(s['Date']).dt.weekday

In [66]:
s.tail()

          Date     Value  Week_Day
255 2011-12-26  0.398214         0
256 2011-12-27 -0.028607         1
257 2011-12-28  1.353897         2
258 2011-12-29 -1.034075         3
259 2011-12-30 -0.902461         4

# Output - sum of the values in s for every Wednesday

In [67]:
s[s['Week_Day']== 2]['Value'].sum()

-10.224360871967825

# Question - 4

In [68]:
'''
4) Average For each calendar month
'''

s['Month'] = pd.to_datetime(s['Date']).dt.month
s.tail()

          Date     Value  Week_Day  Month
255 2011-12-26  0.398214         0     12
256 2011-12-27 -0.028607         1     12
257 2011-12-28  1.353897         2     12
258 2011-12-29 -1.034075         3     12
259 2011-12-30 -0.902461         4     12

# Output - Average of value for each calendar month

In [69]:
s.groupby('Month')['Month','Value'].mean()

       Month     Value
Month
1          1 -0.133896
2          2 -0.115293
3          3 -0.063872
4          4  0.215175
5          5 -0.406456
6          6 -0.178232
7          7  0.124666
8          8 -0.112334
9          9 -0.252290
10        10 -0.304890
11        11  0.088166
12        12 -0.129487

# Question 5

In [70]:
'''
For each group of four consecutive calendar months in s, find the date on which the
highest value occurred.
'''
def four_year_group(x):
    if x in [1,2,3,4]:
        return 1
    elif x in [5,6,7,8]:
        return 2
    else:
        return 3
s['Quarter_of_year'] = s['Month'].apply(lambda x : four_year_group(x))
s.tail()

          Date     Value  Week_Day  Month  Quarter_of_year
255 2011-12-26  0.398214         0     12                3
256 2011-12-27 -0.028607         1     12                3
257 2011-12-28  1.353897         2     12                3
258 2011-12-29 -1.034075         3     12                3
259 2011-12-30 -0.902461         4     12                3

In [71]:
s['Quarter_of_year'].unique()

array([1, 2, 3], dtype=int64)

In [72]:
s.groupby('Quarter_of_year')['Value'].max()

Quarter_of_year
1    1.986340
2    2.534360
3    2.175553
Name: Value, dtype: float64

In [73]:
val  = (s.groupby('Quarter_of_year')['Value'].max()).tolist()

In [74]:
val

[1.9863400526741022, 2.53436049085529, 2.175553244424468]

In [75]:
df = s[(s['Value'] == val[0]) | (s['Value'] == val[1])| (s['Value'] == val[2])].drop(['Week_Day','Month'],axis=1)

# Output - For each group of four consecutive calendar months in s, find the date on which the highest value occurred

In [76]:
df

          Date     Value  Quarter_of_year
34  2011-02-18  1.986340                1
108 2011-06-02  2.534360                2
251 2011-12-20  2.175553                3